import Accordian from "../ui/Accordian";
const FaQ = () => {
  return (
    <section className="max-w-6xl mx-auto mt-10">
      <h2 className="font-body text-[#4B5259] font-bold text-2xl">
        پرسش‌های متداول درباره رزرو هتل در علی‌بابا
      </h2>
      <ul className="flex flex-col space-y-4">
        <Accordian
          title="پیش از رزرو هتل، چگونه درباره هتل و فرآیند رزرو آن اطلاعات کسب کنم؟"
          description="فرایند انتخاب و رزرو اینترنتی هتل در علی بابا بسیار ساده است. به سادگی و با چند کلیک می توانید با انتخاب مقصد و تاریخ سفر خود، هتل مد نظر خود را با قیمت مناسب رزرو کنید. با این حال در صورت نیاز، مرکز پشتیبانی علی بابا به صورت 24 ساعته پاسخگوی شماست."
        />
        <Accordian
          title="هزینه هتل خارجی را چه طور بپردازیم؟ آیا استفاده از کارت‌های شتاب امکان‌پذیر است؟"
          description="زمانی که برای رزرو هتل خارجی به وب‌سایت یا اپلیکیشن علی بابا مراجعه می‌کنید، خیالتان از بابت نحوه پرداخت راحت باشد. شما می‌توانید هزینه رزرو هتل را با همین کارت‌های شتاب خودتان بپردازید. به هیچ وجه نیازی به استفاده از کارت‌های اعتباری خارجی نیست."
        />
        <Accordian
          title="آیا پس از اینکه هتل را رزرو کردیم، می‌توانیم رزرومان را کنسل کنیم و پولمان را پس بگیریم؟"
          description="طبیعی است که گاهی اوقات سفرمان به هر دلیلی کنسل شود. هر کدام از هتل‌ها قوانین خودشان را برای کنسلی دارند.
بعضی از هتل‌ها استرداد پول را می‌پذیرند؛ البته این استرداد در بیشتر موارد با کسر هزینه جریمه است. میزان جریمه هم باز به قوانین هتل و زمانی که کنسلی را اعلام می‌کنید، بستگی دارد. (هر چه دیرتر کنسلی را اعلام کنید، احتمال افزایش جریمه بیشتر است)."
        />
        <Accordian
          title="چه ساعتی می‌توانیم اتاق‌مان را تحویل بگیریم و چه ساعتی باید اتاق را پس بدهیم؟"
          description="معمولا ورود مسافر به اتاق (چک‌این) در ساعت 14 و خروج مسافر (چک‌اوت) ساعت 12 ظهر است."
        />
        <Accordian
          title="نیم‌شارژ ورود و خروج چیست؟"
          description="ساعت ورود به هتل ساعت 14 و خروج 12 ظهر است؛ مسافرانی که ورود زودهنگام (حدود ساعت 8 صبح) یا خروج دیرهنگام (حدود ساعت 18 عصر) را دارند، از این گزینه استفاده می‌کنند؛ قیمت نیم‌شارژ معمولا نصف رزرو یک شب است. با این حال این هزینه توسط هتل تعیین می‌شود و از هتلی به هتل دیگر می‌تواند متفاوت باشد."
        />
        <Accordian
          title="کودکان تا چه سنی رایگان پذیرش می‌شوند و تخت آنها چگونه است؟"
          description="شرایط سنی کودک برای پذیرش در هتل در قسمت «قوانین» اطلاع‌رسانی شده است."
        />
        <Accordian
          title="تفاوت اتاق‌ها با هم مانند دبل یا توئین بودن یا جونیور یا امپریال یا حتی سوئیت چیست؟"
          description="اتاق دبل دو تخت چسبیده‌به‌هم دارد و مناسب زوج‌ها است. اتاق‌های تویین دو تخت سینگل یا جدا از هم دارند. اتاق‌هایی مثل جونیور یا امپریال از نظر متراژ، دیزاین و طبقات نسبت به اتاق‌های استاندارد اتاق‌های باکیفیت‌تری هستند. البته سرویس و خدمات هتل برای همه اتاق‌ها یکسان است."
        />
        <Accordian
          title="واچر چیست؟"
          description="رسید پرداخت و تاییدیه رزرو اقامتگاه را «واچر» می‌گویند. واچر پس از انجام پرداخت توسط شما از طرف سیستم رزرواسیون علی بابا صادر می‌شود و در اختیار شما قرار می‌گیرد."
        />
        <Accordian
          title="دلیل پایین بودن نرخ هتل های علی بابا چیست؟"
          description="علی بابا با تامین‌کنندگان قرارداد سالیانه دارد و در ایام غیرپیک هم مسافر هتل‌ها را تامین می‌کند. این باعث می‌شود تا علی بابا بتواند امکان رزرو ارزان هتل را برای مسافران فراهم کند."
        />
        <Accordian
          title="مبلغ درج شده در وب‌سایت علی بابا مبلغ نهایی است؟ آیا امکان دارد بعدا تغییر کند؟"
          description="مبلغ اعلام‌شده نهایی است، مگر در زمان‌های خاص مانند عید نوروز؛ در این شرایط حتما در هنگام رزرو اعلام می‌شود که نرخ فعلی علی‌الحساب است."
        />
      </ul>
    </section>
  );
};
export default FaQ;
