import Accordian from "../ui/Accordian";
function FaQ() {
  return (
    <div className="max-w-6xl mx-auto mt-10">
      <h3 className="font-body text-[#4B5259] text-xl font-extrabold">
        پرسش های شما
      </h3>

      <div className="mt-10">
        <Accordian
          title="در راه آهن و هنگام سوار شدن به قطار چه مدارکی لازم است؟"
          description="شما برای ورود به قطار باید این مدارک را با خود به همراه داشته باشید: پرینت بلیط و کارت شناسایی معتبر.
          در صورت داشتن تخفیف جانباز یا خانواده شهدا، به همراه داشتن کارت معتبر مربوطه نیاز ضروری است."
        />
        <Accordian
          title="مقدار بار مجاز در قطار چقدر است؟"
          description="
هر مسافر می‌تواند وسایل ضروری سفر خود را همراه ببرد به شرط آن‌كه حجم آن از ابعاد 75 سانتی متر و وزن 30 كیلوگرم تجاوز نكند. به عنوان مثال مسافر می‌تواند كیف‌دستی، بسته‌ و چمدان‌های كوچك محتوی لوازم شخصی، صندلی چرخ‌دار بیمار، كالسكه بچه و قفس كوچك پرندگان ریزجثه (حداكثر در ابعاد 40 سانتی‌متر) را به همراه داشته باشد."
        />
        <Accordian
          title="روال استرداد یا کنسلی بلیط قطار چگونه است؟"
          description="مسافر می‌تواند تا 60 دقیقه قبل از حرکت قطار، بلیط یا بلیط‌های خریداری‌شده را به صورت آنلاین استرداد کند.
          برای استرداد بلیط قطار پس از زمان ذکرشده، مسافر باید تا قبل از حرکت قطار، و با ارایه بلیط چاپی و کارت شناسایی به صورت حضوری به یکی از مراکز فروش بلیط قطار مراجعه کند."
        />
        <Accordian
          title="قیمت بلیط برای کودک و نوزاد چگونه است؟"
          description="قیمت بلیط کودک نیم‌بها و نوزاد 10 درصد مبلغ بزرگسال است."
        />
        <Accordian
          title="چه زمانی باید در ایستگاه حضور داشته باشم؟"
          description="حضور در ایستگاه یک ساعت قبل از حرکت قطار الزامی است. همچنین ده دقیقه مانده به حركت، تمام درهای قطار بسته خواهد شد و بعد از بسته‌شدن درها برای جلوگیری از خطرات احتمالی، سوارشدن به قطار امكان‌پذیر نیست."
        />
        <Accordian
          title="در یک کوپه دربست چند نفر همراه اضافه می‌توان برد؟"
          description="مسافر می‌تواند بعد از دربست‌کردن کوپه فقط یک نفر مسافر اضافی را بدون بلیط با این شرایط به همراه خود به قطار ببرد:
          حق درخواست جا خارج از همان کوپه وجود ندارد
          قبض این مسافر مطابق استحقاق او توسط رئیس قطار صادر می‌شود."
        />
        <Accordian
          title="آیا این امکان وجود دارد که مسافر در پکیج قطار با هتل فدک درخواست اقامت بیشتر در هتل داشته باشد؟ در صورت امکان، وضعیت آن به چه صورتی است؟"
          description="امکان اقامت بیشتر وجود دارد اما باید قبل از خرید با هتل مربوطه هماهنگ کرده باشند؛ همچنین تاریخ رفت و برگشت بلیط قطار باید بر اساس روزهایی باشد که در هتل می‌مانید. گفتنی است اقامت قطار فدک شامل شب اول و شب آخر می‌شود."
        />
        <Accordian
          title="آیا خانوم‌ها می‌توانند بلیط قطار را برای کوپه مخصوص بانوان بخرند؟"
          description="بله این امکان وجود دارد. خانوم‌ها می‌توانند برای آرامش و راحتی خود در طول سفر، بلیط قطار را برای کوپه مخصوص بانوان بخرند. البته کوپه مخصوص آقایان هم برای آن‌ها درنظر گرفته شده است."
        />
        <Accordian
          title="شرایط بیمه قطار چه گونه است؟"
          description="تمام مسافران قطار از لحظه‌ ورود به ایستگاه مبدا تا خروج از ایستگاه مقصد در برابر حوادث بیمه هستند. بیمه‌ حوادث مسافری شامل جبران هزینه‌های پزشكی و همچنین جبران نقص عضو یا فوت ناشی از حوادثی مانندآتش سوزی، تصادف، انفجار، خارج شدن قطار از ریل، مانور، سنگ‌پرانی و سایر حوادث احتمالی می‌شود.`"
        />
      </div>
    </div>
  );
}
export default FaQ;
