import { FaChevronDown, FaChevronUp } from "react-icons/fa";
import { useState } from "react";
import InfoCard from "./InfoCard";
function InfoSection() {
  const [showMore, setShowMore] = useState(false);
  return (
    <div className="max-w-6xl mx-auto mt-20">
      <h2 className="font-body font-bold text-[#4B5259] text-2xl">بلیط قطار</h2>
      <p className="font-body text-justify mt-8">
        هر کسی که یک بار با قطار سفر کرده باشد می‌داند که قطار امن است و همین
        موضوع آن را به یکی از مناسب‌ترین وسائل نقلیه برای سفر به مقاصد دور و
        نزدیک تبدیل کرده. در سفر با قطار می‌توانید بدون نگرانی از نوسانات شرایط
        جوی، کمبود سوخت، تصادفات و... لحظات آرامی را سپری کنید. در کنار این
        موارد، موسیقی ریتمیک حرکت قطار روی ریل به خودی خود موجب آرامش سرنشینان
        می‌شود؛ حتی بعضی از مسافران ادعا کرده‌اند که این ریتم منظم موجب می‌شود
        تا خواب راحت‌تری در قطار داشته باشند.
      </p>
      <div className="flex">
        <p className={`${!showMore ? " truncate w-2/5" : "w-full"} font-body`}>
          علاوه بر امنیت، سفر با قطار مزایای دیگری هم دارد. قیمت مناسب، فضای
          صمیمی و راحت کوپه، صرف غذا در بوفه و قدم زدن در راهرو باعث می‌شود تا
          سختیِ مسیرهای طولانی به حداقل رسیده و خاطره خوشی از سفر در ذهن مسافر
          باقی بماند. بیش از 90 سال از احداث راه‌آهن و اولین سفر با قطار در
          ایران می‌گذرد، اما بسیاری از مسافران با خدمات قطارهای شبکه‌ ریلی کشور
          آشنا نیستند. به همین منظور قصد داریم شما را با امکانات و خدمات قطارهای
          ایران آشنا کنیم تا هنگام خرید آنلاین بلیط قطار، انتخاب‌های بهتری داشته
          باشید.
        </p>
        <p
          className={`text-blue-400 font-body mr-1 flex items-center cursor-pointer`}
          onClick={() => setShowMore(!showMore)}
        >
          {!showMore ? "بیشتر بخوانید" : "بستن"}
          <span className="mr-1">
            {!showMore && <FaChevronDown className="w-3 h-3" />}
            {showMore && <FaChevronUp className="w-3 h-3" />}
          </span>
        </p>
      </div>

      {/* card section */}
      <div className="grid grid-cols-3 justify-items-center mt-10 gap-x-4">
        <InfoCard
          bgPic="info__card_train-man"
          alt="model-man-pic"
          title="خرید اینترنتی بلیط قطار"
          description="خرید اینترنتی بلیط قطار مزایای زیادی دارد، از جمله: مقایسه‌ قیمت بلیط قطارهای مختلف، انتخاب دقیق ساعت حرکت قطار، انتخاب از بین قطارهای متنوع شرکت‌های ریلی، پرداخت سریع و آسان با کارت شتابی، استرداد کاملا آنلاین بلیط قطار، خرید مطمئن بلیط مقاصد پرسفر، رزرو آسان بلیط قطار در فصل‌های شلوغ و مطلع شدن از پیش‌فروش قطارها از طریق ایمیل. شما به راحتی می‌توانید با مراجعه به www.alibaba.ir بلیط قطار خود را به آسانی و با چند کلیک ساده خریداری کنید."
        />
        <InfoCard
          bgPic="info__card_train-station"
          alt="train-station-pic"
          title="استرداد آنلاین بلیط قطار"
          description="در گذشته، استرداد بلیط قطار از دغدغه‌های اصلی مسافران بود. حتی مسافرانی که بلیط را آنلاین می‌خریدند، برای استرداد آن مجبور بودند به صورت حضوری به دفاتر فروش مراجعه کنند. علی‌بابا با فراهم کردن زیرساخت‌های لازم، خدمت استرداد آنلاین بلیط قطار را به مسافران ارائه می‌کند و شما با مراجعه به حساب کاربری خود در علی‌بابا با چند کلیک ساده می‌توانید بلیط را به صورت کاملا آنلاین استرداد کنید و مبلغ آن را (پس از کسر جریمه‌ کنسلی) در حساب بانکی‌تان دریافت کنید."
        />
        <InfoCard
          bgPic="info__card_train-people"
          alt="people-pic"
          title="خرید گروهی"
          description="یکی از دغدغه‌های مسافران قطار، امکان رزرو بلیط برای سفرهای خانوادگی و گروهی است. مشتریان علی‌بابا می‌توانند تا سقف ۶ بلیط برای ۶ نفر را در یک سفارش و با یک بار پرداخت خریداری کنند. همچنین در صورتی که قصد خرید بلیط برای تعداد مسافران بیشتری را داشته باشید و می‌خواهید صندلی‌هایتان در کنار هم باشد، کافیست با پشتیبانی علی‌بابا تماس بگیرید. در کنار همه این‌ها، استرداد هر تعداد بلیط در علی‌بابا به راحتی و در کمترین زمان ممکن انجام می‌شود."
        />
      </div>
    </div>
  );
}
export default InfoSection;
