import Accordian from "../ui/Accordian";
function FaQ() {
  return (
    <div className="max-w-6xl mx-auto mt-10">
      <h3 className="font-body text-[#4B5259] text-xl font-extrabold pr-2">
        پرسش های شما
      </h3>

      <div className="mt-10">
        <Accordian
          title="آیا نیاز به خرید بلیط اتوبوس برای کودکان و اطفال زیر ۲ سال هم وجود دارد؟"
          description="بلیط اتوبوس افراد زیر دو سال در صورتی که صندلی به آن‌ها تعلق نگیرد رایگان است ولی در صورتی که نیاز به استفاده از صندلی داشته باشید، می‌بایست هزینه بلیط اتوبوس را کامل پرداخت نمایید."
        />
        <Accordian
          title="امکان حمل حیوانات خانگی در داخل اتوبوس وجود دارد؟"
          description="طبق قوانین سازمان حمل‌ونقل امکان حمل حیوانات زنده در اتوبوس وجود ندارد."
        />
        <Accordian
          title="مدارک مورد نیاز برای استفاده از اتوبوس چیست؟"
          description="به همراه داشتن کارت شناسایی معتبر (کارت ملی یا شناسنامه) برای دریافت بلیط الزامی است."
        />
        <Accordian
          title="آیا برای استفاده از اتوبوس نیاز به پرینت بلیط است؟"
          description="
          برای استفاده از بلیط‌ اتوبوس، چاپ بلیط در دفتر تعاونی مربوطه با ارائه پیامک شماره بلیط و کارت شناسایی معتبر الزامی است."
        />
        <Accordian
          title="جهت سوار شدن به اتوبوس چه مدت قبل از حرکت در ترمینال حضور داشته باشیم؟"
          description="در صورتی که حرکت سرویس در ساعت مقرر انجام گردد مسافر می بایست حداکثر 30 دقیقه قبل حرکت سرویس در ترمینال مبدا حضور داشته باشد."
        />
        <Accordian
          title="چگونه می‌توانم بلیط اتوبوسم را استرداد کنم؟"
          description="در صورت قابل استرداد بودن بلیط خریداری شده، در «پنل کاربری» از منوی «سفارشات و استردادها»، سفارش مورد نظر را انتخاب کنید؛ بعد از کلیک بر روی گزینه استرداد و تکمیل مراحل، بلیط مورد نظر طبق قوانین و مقررات استرداد می‌شود.
          هزینه‌ای که مسترد می‌شود به همان شماره حسابی واریز می‌شود که خرید انجام شده است. اگر لازم است که هزینه مسترد شده به حساب دیگری واریز گردد، باید با پشتیبانی تماس گرفته و آن‌ها را در جریان بگذارید."
        />
        <Accordian
          title="میزان بار مجاز هر مسافر در سفر با اتوبوس چقدر است؟"
          description="طبق قوانین سازمان حمل‌ونقل میزان بار مجاز 20 کیلوگرم است. البته برخی از تعاونی‌ها با دریافت هزینه، امکان حمل بار تا 40 کیلوگرم را نیز ارائه می‌دهند. همچنین یکی دیگر از مسائلی که در این زمینه باید مد نظر قرار بدهید، تعاونی اتوبوس شماست."
        />
      </div>
    </div>
  );
}
export default FaQ;
