import { FaChevronDown, FaChevronUp } from "react-icons/fa";
import { BsDot } from "react-icons/bs";
import { useState } from "react";
import InfoCard from "@/components/train/InfoCard";
import CompanyLogo from "./CompanyLogo";
function InfoSection() {
  const [showMore, setShowMore] = useState(false);
  return (
    <section className="mt-20 max-w-6xl mx-auto ">
      <h2 className="font-body text-2xl text-[#4B5259] font-bold">
        بلیط اتوبوس
      </h2>
      <p className="font-body pt-2">
        سفر با اتوبوس به دلیل پایین آوردن هزینه‌ها و البته راحتی و امنیت بالا
        مورد استقبال مسافران است. با توسعه فناوری‌های نوین و ایجاد رفتار خرید
        اینترنتی، دیگر نیازی نیست برای خرید بلیط اتوبوس به ترمینال شرق و سایر
        ترمینال‌های اتوبوس‌رانی مراجعه کنید.
      </p>
      <div className="flex items-start pt-2">
        <p className={`${!showMore ? "truncate w-3/5" : "w-full"}  font-body`}>
          علی‌بابا با توجه به اعتبار و پیشینه‌ای که در زمینه عرضه بلیط سفر و
          سایر خدمات گردشگری دارد، بهترین وب‌سایت رزرو بلیط اتوبوس است. شما
          می‌توانید در علی‌بابا بهترین قیمت را برای خرید بلیط اتوبوس پیدا کنید؛
          همچنین این امکان را دارید تا از بین شرکت‎‌های اتوبوس‌رانی مختلف دست به
          انتخاب بزنید. علی‌بابا به عنوان مرجع فروش بلیط اینترنتی اتوبوس، تمام
          مسیرهای زمینی داخل کشور و تعدادی از مسیرهای خارجی را پوشش می‌دهد. در
          دسترس بودن لیست کاملی از شرکت‌های اتوبوس‌رانی در سایت علی‌بابا امکان
          خرید آنلاین بلیط اتوبوس را با قیمت مناسب برای شما ممکن می‌سازد. از طرف
          دیگر اگر ترجیح شما رفاه و آرامش بیشتر در طول سفر است، می‌توانید بلیط
          اتوبوسی را بخرید که اگرچه قیمتش کمی بیشتر است، اما از امکانات رفاهی
          بیشتری نیز برخوردار است و سفر را برای شما دلپذیرتر می‌کند. ضمنا شما
          هنگام خرید آنلاین بلیط اتوبوس از علی‌بابا، علاوه بر انتخاب صندلی،
          می‌توانید طول مسیر، ساعت حرکت و قوانین استرداد بلیط را نیز مشاهده
          کنید.
        </p>
        <span
          className="font-body hover__anime text-blue-400 hover:bg-blue-100 rounded-xl p-1 flex items-center cursor-pointer -mt-1"
          onClick={() => setShowMore(!showMore)}
        >
          {!showMore ? "بیشتر بخوانید" : "بستن"}
          <i>
            {!showMore ? (
              <FaChevronDown className="w-3 h-3 mr-1" />
            ) : (
              <FaChevronUp className="w-3 h-3 mr-1" />
            )}
          </i>
        </span>
      </div>
      {/* 3 column card section */}
      <div className="grid grid-cols-3 gap-x-3 mt-6">
        <InfoCard
          bgPic="info__card_ByBusTicket"
          title="خرید بلیط اتوبوس"
          description="خرید اینترنتی بلیط اتوبوس، مسافران را از اینکه خیلی زودتر در ترمینال حضور داشته باشند، بی‌نیاز ساخته است. شما می‌توانید همین طور که در خانه نشسته‌اید، خرید بلیط برای اتوبوس را انجام دهید.
برای اینکه سفر را برای خود راحت‌تر و لذت‌بخش‌تر کنید، می‌توانید برای خرید بلیط VIP اقدام کنید. اگرچه قیمت بلیط اتوبوس VIP کمی گران‌تر است، اما ارزشش را دارد. ضمنا با خرید بلیط رویال سفر هم سفری بی‌دردسر را تجربه خواهید کرد، چرا که این شرکت هم شرایط رفاهی قابل‌قبولی برای مسافران فراهم می‌کند.
هنگام خرید آنلاین بلیط اتوبوس از علی‌بابا کاربران این امکان را خواهند داشت که از میان شرکت‌های موجود، مناسب‌ترین انتخاب را برای خود داشته باشند."
        />
        <InfoCard
          bgPic="info__card_ReserveTicket"
          title="رزرو بلیط اتوبوس"
          description="رزرو بلیط راهکاری دوراندیشانه و عاقلانه برای کسانی است که می‌خواهند از زمان‌بندی سفرشان مطمئن باشند. این موضوع زمانی اهمیت بیشتری می‌یابد که بخواهید بلیط را برای زمان‌های پرسفر رزرو کنید. راحت‌ترین روش، رزرو اینترنتی بلیط اتوبوس از سایت علی‌بابا است.
به این ترتیب می‌توانید ساعت حرکت و شرکت اتوبوس‌رانی موردنظرتان را انتخاب کنید. مراجعه به یک سایت رزرو بلیط‌های اتوبوس معتبر نظیر علی‌بابا، خیال شما را از تهیه بلیط اتوبوس برای تاریخ موردنظرتان آسوده می‌کند. امکاناتی نظیر مشاهده مسافت و قوانین استرداد و البته طول مسافت، علی‌بابا را به بهترین سامانه رزرو بلیط اتوبوس تبدیل کرده است."
        />
        <InfoCard
          bgPic="info__card_TicketPrice"
          title="قیمت بلیط اتوبوس"
          description="همان طور که اشاره شد، ارزان بودن قیمت بلیط نسبت به سایر وسایل نقلیه بین‌شهری، یکی از انگیزه‌های اصلی مردم برای سفر با اتوبوس است. عوامل متعددی در تعیین قیمت بلیط‌های اتوبوس موثرند که از مهم‌ترین آن‌ها می‌توان به طول سفر و امکانات اتوبوس اشاره کرد.
اما اگر به دنبال استعلام قیمت بلیط اتوبوس برای یک یا چند مسیر هستید، می‌توانید به علی‌بابا مراجعه کنید. کافی است مبدا، مقصد و زمان سفر را مشخص کنید تا لیست کاملی از قیمت بلیط اتوبوس شرکت‌های مختلف را مشاهده کنید.
ضمنا قیمت بلیط VIP را نیز می‌توانید در همین لیست ببینید. اگر هم به دنبال بلیط اتوبوس ارزان هستید، می‌توانید در تنظیمات بالای صفحه، بلیط‌ها را براساس کمترین قیمت تعیین کنید."
        />
      </div>
      {/* extradition info section */}
      <div className="mt-10">
        <h2 className="font-body text-2xl text-[#4B5259] font-bold">
          استرداد بلیط اتوبوس
        </h2>
        <p className="pt-4 font-body">
          طبیعی است که گاهی اوقات، سفرتان به هر دلیلی لغو شود. در این زمان به
          دنبال استرداد بلیط (کنسلی) هستید. اگر بلیط‌تان را از علی‌بابا
          خریده‌اید، نگران نباشید؛ فرآیند استرداد بلیط اتوبوس در علی‌بابا راحت و
          بی‌دردسر است. کافی است وارد حساب کاربری‌تان شوید و روی نام کاربری‌تان
          کلیک کنید. در لیست نمایش داده شده، روی سفارشات و استردادها کلیک کنید.
          در صفحه بعد شماره سفارش خود را وارد و سپس روی جستجو کلیک کنید. پس از
          اتمام مراحل استرداد، پولی که بابت خرید بلیط پرداخته‌اید، در کوتاه‌ترین
          زمان ممکن به حساب شما برمی‌گردد.
          <br />
          زمانی که بلیط را می‌خرید به قوانین بلیط هم دقت کنید. قوانین استرداد را
          در همان پنجره بلیط، در بخش «اطلاعات بیشتر» مشاهده خواهید کرد. این
          قوانین به شما می‌گوید که جریمه استرداد یا کنسلی بلیط اتوبوس چه میزان
          است.
        </p>
      </div>
      {/* 2 columns grid - ticket type description Card */}
      <div className="grid grid-cols-2 gap-x-8 mt-10">
        <InfoCard
          bgPic="info__card_VipTicket"
          title="بلیط اتوبوس VIP"
          description="اگر زیاد با اتوبوس سفر نکرده‌ باشید، احتمالا از خود می‌پرسید که چرا باید برای سفر بلیط VIP تهیه کنید. اما کافی است یک بار بلیط VIP بخرید و از سفری آرام با امکانات رفاهی عالی لذت ببرید.
خرید بلیط اتوبوس VIP در سفرهای طولانی اهمیت بیشتری پیدا می‌کند، چرا که در سفر طولانی به آسایش و شرایط بهتر برای خواب بیشتر نیاز خواهید داشت. اتوبوس‎های VIP صندلی‌های استاندارد و راحتی دارند که در صورت تمایل به تخت تبدیل می‌شوند.
پذیرایی‌ در طول مسیر هم از دیگر امکانات این نوع اتوبوس‌هاست. بلیط VIP را به سادگی می‌توانید در علی‌بابا بخرید؛ در لیستی که از بلیط‌های اتوبوس‌ها مشاهده می‌کنید، اتوبوس‌های VIP به وضوح مشخص شده‌اند."
        />
        <InfoCard
          bgPic="info__card_NormalTicket"
          title="بلیط اتوبوس ارزان"
          description="اگر می‌خواهید هزینه سفرتان کمتر شود، احتمالا به دنبال بلیط ارزان هستید. همان طور که اشاره شد قیمت بلیط به عوامل مختلفی نظیر طول سفر و شرکت اتوبوس‌رانی بستگی دارد.
بنابراین برای پیدا کردن اتوبوس ارزان در یک مقصد مشخص، باید بلیط را از شرکتی بخرید که ارزان‌فروش‌تر از بقیه است. برای این کار پس از اینکه مبدا، مقصد و تاریخ سفر را در علی‌بابا مشخص می‌کنید، لیست مفصلی از بلیط‌ها را می‌بینید. در این مرحله، در بالای صفحه یک فیلتر به نام «قیمت» وجود دارد.
وقتی روی آن کلیک کنید، قیمت بلیط اتوبوس در مسیر موردنظرتان را از کمترین قیمت می‌بینید. حالا امکان خرید بلیط اتوبوس ارزان برای شما فراهم شده است."
        />
      </div>
      {/* Bus Company description */}
      <div className="mt-10">
        <h2 className="font-body text-[#4B5259] font-bold text-2xl">
          شرکت‌های اتوبوس‌رانی
        </h2>
        <p className="font-body pt-4 text-justify">
          در حال حاضر، شرکت‌های اتوبوس‌رانی متعددی وجود دارند که تمام مسیرهای
          داخل و برخی از مسیرهای خارج از کشور را پوشش می‌دهند. این شرکت‌ها در
          بسیاری از امکانات و خدمات مشترک‌اند و در عین حال تفاوت‌هایی با هم
          دارند.
        </p>
        <p className="font-body text-justify">
          زمانی که برای خرید بلیط اتوبوس جستجو می‌کنید، این شرکت‌ها گزینه‌های
          مختلفی برای شما دارند و می‌توانید با توجه به شرایط خود از بین آنها
          انتخاب کنید. در ادامه چند مورد از معروف‌ترین شرکت‌های اتوبوس‌رانی کشور
          را به شما معرفی می‌کنیم.
        </p>
      </div>
      {/* company Logo section */}
      <div className="flex items-center justify-between mt-7">
        <CompanyLogo
          Logo="/images/BusCompanyLogo/ariaSafar.png"
          Name="ایران پیما"
          alt="ایران پیما"
        />
        <CompanyLogo
          Logo="https://cdn.alibaba.ir/h/desktop/assets/images/bus07-70e4567f.png"
          Name="رویال سفر ایرانیان"
          alt="رویال سفر ایرانیان"
        />
        <CompanyLogo
          Logo="https://cdn.alibaba.ir/h/desktop/assets/images/bus08-2ebb5e64.png"
          Name="سیر سفر"
          Name="سیر سفر"
        />
        <CompanyLogo
          Logo="/images/BusCompanyLogo/ariaSafar.png"
          Name="آریا سفر"
          alt="آریا سفر"
          س
        />
        <CompanyLogo
          Logo="https://cdn.alibaba.ir/h/desktop/assets/images/bus10-dec50396.png"
          Name="همسفر"
          alt="همسفر"
        />
        <CompanyLogo
          Logo="https://cdn.alibaba.ir/h/desktop/assets/images/bus11-dd96cbb3.png"
          Name="گیتی پیما"
          alt="گیتی پیما"
        />
        <CompanyLogo
          Logo="https://cdn.alibaba.ir/h/desktop/assets/images/bus12-18a07931.png"
          Name="ماهان سفر"
          alt="ماهان سفر"
        />
        <CompanyLogo
          Logo="/images/BusCompanyLogo/ariaSafar.png"
          Name="تعاونی شماره 15"
          alt="تعاونی شماره 15"
        />
      </div>
      {/* Bus Comapnt Info description */}
      {/* iran-peima */}
      <div className="mt-8">
        <h2 className="text-[#4B5259] font-body text-xl font-bold">
          ایران‌پیما
        </h2>
        <p className="text-justify font-body pt-2">
          ایران‌پیما یکی از معروف‌ترین و قدیمی‌ترین شرکت‌های اتوبوس‌رانی کشور
          است. از سال‌ها قبل ایران‌پیما در بیشتر شهرهای کشور نمایندگی داشته است.
          تا همین چند سال پیش بود که اتوبوس‌های بنز این شرکت را با رنگ قرمز و
          شکل خاص نوشته شدن ایران‌پیما روی بدنه اتوبوس تشخیص می‌دادیم؛ اما
          امروزه این شرکت اتوبوس‌رانی از اتوبوس‌هایی نظیر ولوو و اسکانیا نیز در
          ترکیب خود استفاده می‌کند. در حال حاضر بیشتر اتوبوس‌های شرکت ایران‌پیما
          از نوع VIP هستند. شما می‌توانید به سادگی بلیط اتوبوس ایران پیما و سایر
          شرکت‌ها را از علی‌بابا رزرو کنید.
        </p>
      </div>
      {/* rotal safar */}
      <div className="mt-8">
        <h2 className="text-[#4B5259] font-body text-xl font-bold">
          رویال سفر ایرانیان
        </h2>
        <p className="text-justify font-body pt-2">
          شرکت رویال سفر ایرانیان از سال 1385 کار خود را شروع کرد. می‌توان گفت
          با آغاز به کار رویال سفر بود که سطح سفرهای بین‌شهری با اتوبوس وارد
          مرحله جدیدی شد. اتوبوس‌های این شرکت با برخورداری از امکانات مدرن و
          به‌روز مسافران را با شکل جدیدی از سفر مواجه کرد. در حال حاضر، رویال
          سفر ایرانیان دارای 550 دستگاه اتوبوس VIP است. گفتنی است این شرکت در 50
          شهر در داخل و خارج از کشور نمایندگی دارد. شما می‌توانید به سادگی بلیط
          اتوبوس رویال سفر و سایر شرکت‌ها را از علی‌بابا رزرو کنید.
        </p>
      </div>
      {/* seir va safar */}
      <div className="mt-8">
        <h2 className="text-[#4B5259] font-body text-xl font-bold">
          سیر و سفر
        </h2>
        <p className="text-justify font-body pt-2">
          یکی دیگر از شرکت‌های اتوبوس‌رانی معروف کشور، سیر و سفر است. این شرکت
          اتوبوس‌رانی در سال 1369 آغاز به کار کرد و از آن سال تا به حال
          فعالیت‌های خود را توسعه داده است. بسیاری از اتوبوس‌های شرکت سیر و سفر
          از نوع VIP هستند و امکانات رفاهی مطلوبی برای مسافران به وجود می‌آورند.
          شما می‌توانید به سادگی بلیط اتوبوس سیر و سفر و سایر شرکت‌ها را از
          علی‌بابا رزرو کنید.
        </p>
      </div>
      {/* aria safar */}
      <div className="mt-8">
        <h2 className="text-[#4B5259] font-body text-xl font-bold">آریا سفر</h2>
        <p className="text-justify font-body pt-2">
          از دیگر شرکت‌های اتوبوس‌رانی کشور می‌توان به آریا سفر اشاره کرد. نام
          کامل این شرکت اتوبوس‌رانی، شركت تعاونی مسافربری شماره 11 آریا سفر است
          که بسیاری از مسیرهای داخل کشور را پوشش می‌دهند. آریا سفر تنها از دو
          پایانه مسافربری تهران یعنی، ترمینال غرب و ترمینال جنوب عازم مسیرهای
          مختلف می‌شود. آریا سفر هم در بسیاری از شهرهای کشور نمایندگی دارد. شما
          می‌توانید به سادگی بلیط اتوبوس آریا سفر و سایر شرکت‌ها را از علی‌بابا
          رزرو کنید.
        </p>
      </div>
      {/* hamsafar */}
      <div className="mt-8">
        <h2 className="text-[#4B5259] font-body text-xl font-bold">همسفر</h2>
        <p className="text-justify font-body pt-2">
          شرکت اتوبوس‌رانی همسفر از سال 1378 کار خود را شروع کرد. در ابتدا تنها
          هفت دستگاه اتوبوس برای این شرکت کار می‌کردند؛ اما با گذشت زمان و
          استقبال مردم از خدمات همسفر، تعداد اتوبوس‌‌ها و گستره فعالیت‌های آن
          افزایش یافت. شما برای سفر به نقاط مختلف کشور می‌توانید بلیط همسفر را
          هم آنلاین بخرید و راهی شوید. شما می‌توانید به سادگی بلیط اتوبوس همسفر
          و سایر شرکت‌ها را از علی‌بابا رزرو کنید.
        </p>
      </div>
      {/* giti peima */}
      <div className="mt-8">
        <h2 className="text-[#4B5259] font-body text-xl font-bold">
          گیتی پیما
        </h2>
        <p className="text-justify font-body pt-2">
          یکی دیگر از شرکت‌های اتوبوس‌رانی قدیمی ایران، شرکت گیتی پیما است. گیتی
          پیما که نام کاملش شرکت بین المللی گیتی پیما ایرانیان است، برای بسیاری
          از شهرهای مختلف کشور اتوبوس دارد. برای خرید بلیط گیتی پیما کافی است در
          صفحه خرید بلیط اتوبوس علی‌بابا، در پنجره کناری گزینه گیتی پیما را فعال
          کنید. شما می‌توانید به سادگی بلیط اتوبوس گیتی پیما و سایر شرکت‌ها را
          از علی‌بابا رزرو کنید.
        </p>
      </div>
      {/* mahan safar */}
      <div className="mt-8">
        <h2 className="text-[#4B5259] font-body text-xl font-bold">
          ماهان سفر
        </h2>
        <p className="text-justify font-body pt-2">
          شرکت اتوبوس‌رانی ماهان سفر در سال 1372 کار خود را آغاز کرد، از آن پس
          فعالیت‌های شرکت گسترش یافت. یکی از اهداف فعلی ماهان سفر ایرانیان
          افزایش تعداد اتوبوس‌های VIP در مسیر جنوب و جنوب غرب کشور است. پذیرایی
          از مسافران با صبحانه، غذا و نوشیدنی سرد و گرم، ارائه مجله، در دسترس
          بودن پتو و بالش و پخش فیلم‌ سینمایی از جمله امکانات اتوبوس‌های VIP
          ماهان سفر است. شما می‌توانید به سادگی بلیط اتوبوس ماهان سفر و سایر
          شرکت‌ها را از علی‌بابا رزرو کنید.
        </p>
      </div>
      {/* 4 column grid section - links */}
      <div className="pt-10 pb-0 flex flex-row justify-between">
        <div>
          <ul>
            <li className="flex flex-row items-center font-body cursor-pointer">
              <span>
                <BsDot className="text-[#ffb400] w-8 h-8" />
              </span>
              بلیط اتوبوس تهران مشهد
            </li>
            <li className="flex flex-row items-center font-body cursor-pointer">
              <span>
                <BsDot className="text-[#ffb400] w-8 h-8" />
              </span>
              بلیط اتوبوس مشهد تهران
            </li>
            <li className="flex flex-row items-center font-body cursor-pointer">
              <span>
                <BsDot className="text-[#ffb400] w-8 h-8" />
              </span>
              بلیط اتوبوس تهران اصفهان
            </li>
          </ul>
        </div>
        <div>
          <ul>
            <li className="flex flex-row items-center font-body cursor-pointer">
              <span>
                <BsDot className="text-[#ffb400] w-8 h-8" />
              </span>
              بلیط اتوبوس اصفهان تهران
            </li>
            <li className="flex flex-row items-center font-body cursor-pointer">
              <span>
                <BsDot className="text-[#ffb400] w-8 h-8" />
              </span>
              بلیط اتوبوس تهران شیراز
            </li>
            <li className="flex flex-row items-center font-body cursor-pointer">
              <span>
                <BsDot className="text-[#ffb400] w-8 h-8" />
              </span>
              بلیط اتوبوس شیراز تهران
            </li>
          </ul>
        </div>
        <div>
          <ul>
            <li className="flex flex-row items-center font-body cursor-pointer">
              <span>
                <BsDot className="text-[#ffb400] w-8 h-8" />
              </span>
              بلیط اتوبوس تهران استانبول
            </li>
            <li className="flex flex-row items-center font-body cursor-pointer">
              <span>
                <BsDot className="text-[#ffb400] w-8 h-8" />
              </span>
              بلیط اتوبوس استانبول تهران
            </li>
            <li className="flex flex-row items-center font-body cursor-pointer">
              <span>
                <BsDot className="text-[#ffb400] w-8 h-8" />
              </span>
              بلیط اتوبوس تهران اهواز
            </li>
          </ul>
        </div>
        <div>
          <ul>
            <li className="flex flex-row items-center font-body cursor-pointer">
              <span>
                <BsDot className="text-[#ffb400] w-8 h-8" />
              </span>
              بلیط اتوبوس اهواز تهران
            </li>
            <li className="flex flex-row items-center font-body cursor-pointer">
              <span>
                <BsDot className="text-[#ffb400] w-8 h-8" />
              </span>
              بلیط اتوبوس تهران تبریز
            </li>
            <li className="flex flex-row items-center font-body cursor-pointer">
              <span>
                <BsDot className="text-[#ffb400] w-8 h-8" />
              </span>
              بلیط اتوبوس تبریز تهران
            </li>
          </ul>
        </div>
      </div>
    </section>
  );
}
export default InfoSection;
