import Image from "next/image";
function InfoSection() {
  return (
    <div className="max-w-6xl mx-auto mt-20">
      <div className="flex flex-row justify-between">
        {/* right section */}
        <div className="flex flex-col w-1/2 space-y-12">
          <div>
            {/* top part */}
            <div className="flex flex-col space-y-2">
              <h2 className="text-xl text-[#4B5259] font-extrabold font-body">
                خرید بلیط هواپیما خارجی
              </h2>
              <p className="text-[#4B5259] font-body text-justify">
                شرکت سفرهای علی‌بابا که فعالیتش را از سال 1393 شروع کرد، بعد از
                چندین سال فعالیت در زمینه فروش اینترنتی بلیط سفر، توانست که رتبه
                یک این حوزه را از آن خودش کند و رضایت 97.2 درصد از مشتریان را با
                ارائه خدمات شایسته و پشتیبانی 24 ساعته به دست بیاورد. مطمئن
                باشید که اگر شما هم برای خرید بلیط هواپیما خارجی به علی‌بابا
                اعتماد کنید، پشیمان نخواهید شد.
              </p>
            </div>
            {/* bottom part */}
          </div>
          <div>
            <h2 className="text-xl text-[#4B5259] font-extrabold font-body">
              مزایای رزرو بلیط پرواز خارجی از علی‌بابا
            </h2>
            <p className="text-[#4B5259] font-body text-justify mt-4">
              یکی از دلایلی که برای خرید بلیط پرواز خارجی می‌توانید روی علی‌بابا
              حساب کنید فرایند خرید آسان و پنل کاربرپسند آن است. در ابتدا وارد
              وب‌سایت علی‌بابا شده و اطلاعات سفر (یعنی شهرهای مبدا و مقصد، تاریخ
              حرکت و تعداد مسافرین) را وارد کنید. حالا فقط با یک کلیک، لیستی
              کامل از پرواز خارجی برای شما فهرست خواهد شد. اگر دقت کنید خواهید
              دید که قیمت هر کدام از این موارد با دیگری فرق دارد و شما حتما باید
              قبل از خرید بلیط هواپیما خارجی، این موارد را بررسی کنید تا بتوانید
              مناسب‌ترین گزینه را بر اساس سلیقه و بودجه‌تان پیدا کنید. این که
              برای رزرو پرواز خارجی لیستی از گزینه‌ها پیش روی شماست یکی از
              مزایای خرید بلیط از وب‌سایت علی‌باباست، چراکه دست شما در انتخاب
              باز است و می‌توانید بلیط‌های ایرلاین‌های متفاوت را با هم مقایسه
              کنید.
            </p>
          </div>
        </div>
        {/* left section */}
        <div>
          <Image
            src="https://cdn.alibaba.ir/h/desktop/assets/images/baggage/baggage@3x-bda919ec.webp"
            width={456}
            height={329}
            alt="bag-pic"
          />
        </div>
      </div>
      {/* down section of info - bottom of image */}
      <div className="w-full mt-5">
        <h2 className="text-xl text-[#4B5259] font-extrabold font-body mt-8">
          خرید بلیط هواپیما خارجی ارزان با تقویم قیمتی علی‌بابا
        </h2>
        <p className="text-[#4B5259] font-body text-justify mt-4">
          یکی دیگر از امکاناتی که برای پیدا کردن پرواز خارجی ارزان دارید،
          استفاده از تقویم نمایش داده شده در بالای صفحه است. در این تقویم قیمتی،
          با یک کلیک می‌توانید قیمت بلیط هواپیما خارجی روزهای قبل و روزهای بعد
          را مشاهده کنید و اگر مجبور نیستید که در روز خاصی سفرتان را شروع کنید،
          می‌توانید گزینه‌های به‌صرفه‌تری را انتخاب کنید؛ چرا که یکی از روزهای
          هفته با رنگ سبز نمایش داده شده و این به معنای بلیط هواپیما ارزان در آن
          روز خاص هست. تعداد بلیط هواپیما خارجی که فهرست شده است زیاد است؟ یا
          وقت ندارید که بین همه گزینه‌ها بگردید؟ مساله‌ای نیست چون علی‌بابا فکر
          اینجای کار را هم کرده است. درسمت راست و بالای صفحه، تعدادی فیلتر
          مشاهده می‌کنید که مواردی مانند نوع ایرلاین، کلاس پروازی (اکونومی یا
          بیزینس)، بازه قیمت، نوع بلیط (چارتری یا سیستمی) و... را در اختیار شما
          می‌گذارد. برای سهولت در پیدا کردن پرواز خارجی دلخواه‌تان می‌توانید از
          این فیلترها استفاده کنید تا فقط گزینه‌هایی که مدنظرتان است برای شما
          نمایش داده شود. همچنین در بالای صفحه هم دو گزینه مرتب‌سازی وجود دارد
          (مرتب‌سازی بر اساس قیمت و زمان). اگر از این فیلترها استفاده کنید،
          ترتیب نمایش بلیط هواپیما خارجی بر اساس ترتیبی که مد نظر شماست تغییر
          خواهد کرد تا بلیط‌تان را آسان‌تر پیدا کنید.
        </p>
        <h2 className="text-xl text-[#4B5259] font-extrabold font-body mt-8">
          ایرلاین‌ها یا خطوط هوایی علی‌بابا در پروازهای خارجی
        </h2>
        <p className="text-[#4B5259] font-body text-justify mt-4">
          یکی دیگر از سوالاتی که در حین خرید بلیط هواپیما خارجی به ذهن مشتریان
          می‌رسد این است که بلیط هواپیمای چه خطوط هوایی را می‌توانیم از علی‌بابا
          بخریم. خوشبختانه بلیط هواپیما خارجی تمام خطوط هوایی در وب‌سایت
          علی‌بابا موجود است و این مقصد و سلیقه شماست که تعیین می‌کند کدام گزینه
          را انتخاب کنید. همچنین اگر تعداد شما بیش از ۹ نفر است، نیازی به رزرو
          پرواز خارجی به صورت تک‌به‌تک ندارید؛ به راحتی می‌توانید یک درخواست
          گروهی بدهید تا بلیط تمام افراد به صورت یک‌جا برای شما صادر شود. راستی،
          اصلا فرقی نمی‌کند که بلیط هواپیما خارجی می‌گیرید یا داخلی؛ برای خرید
          بلیط هواپیما از علی‌بابا و پرداخت وجه آن می‌توانید از کارت‌های بانکی
          عضو شتاب استفاده کنید و نیازی به کارت اعتباری خارجی و ارز ندارید.
        </p>
        <h2 className="text-xl text-[#4B5259] font-extrabold font-body mt-8">
          امکان استرداد بلیط هواپیما خارجی در علی‌بابا
        </h2>
        <p className="text-[#4B5259] font-body text-justify mt-4">
          امکانات و خدمات علی‌بابا هنوز تمام نشده! علی‌بابا همیشه تمام سعیش را
          می‌کند که مشتریانش را راضی نگه داشته و تمام خدمات ممکن را به آن‎ها
          ارائه بدهد. به همین دلیل، استرداد بلیط (کنسلی بلیط) هم یکی از این
          گزینه‌هاست. شاید بعد از خرید بلیط هواپیما خارجی، مشکلی برای شما پیش
          بیاید که مجبور شوید سفرتان را کنسل کرده و یا تاریخ آن را تعویض کنید.
          برای این کار می‌توانید تقاضای استرداد بلیط هواپیما خارجی را برای
          کارشناسان ما بفرستید تا بلیط شما را گرفته و پولتان را به شما
          بازگردانند. همچنین برای استفاده از سرویس استرداد بلیط در علی‌بابا
          نیازی به مراجعه حضوری ندارید؛ فقط کافی است که قوانین کنسلی را روی
          وب‌سایت مطالعه کرده و مدارک لازم را روی وب‌سایت بارگذاری کنید. دقت و
          تخصصی که در طراحی وب‎سایت علی‌بابا به کار گرفته شده، باعث شده است که
          تمام صفحات آن با تمام دستگاه‌ها (موبایل، لپ‌تاپ و تبلت) سازگاری داشته
          باشد و به همین دلیل در حین خرید بلیط هواپیما خارجی از هر دستگاهی که
          استفاده کنید، به هیچ مشکلی برنخواهید خورد.
        </p>
        <h2 className="text-xl text-[#4B5259] font-extrabold font-body mt-8">
          رزرو بلیط پروازهای خارجی با اپلیکیشن علی‌بابا
        </h2>
        <p className="text-[#4B5259] font-body text-justify mt-4">
          البته برای خرید بلیط هواپیما خارجی (یا هر نوع بلیط، هتل و تور) هیچ
          الزامی وجود ندارد که حتما از وب‌سایت استفاده کنید. علی‌بابا یک
          اپلیکیشن زیبا و کاربردی هم دارد که از طریق کافه بازار هم قابل دانلود
          است. اگر این اپلیکیشن را دانلود کنید، کار شما آسان‌تر هم خواهد شد.
          همچنین دانلود اپلیکیشن برای اپلی‌ها هم امکان‌پذیر است.
        </p>
        <h2 className="text-xl text-[#4B5259] font-extrabold font-body mt-8">
          با پشتیبانی 24 ساعته علی‌بابا، با خیال راحت بلیط پرواز خارجی رزرو کنید
        </h2>
        <p className="text-[#4B5259] font-body text-justify mt-4">
          این که در حین خرید بلیط هواپیما خارجی یا حتی بعد از خرید، سوال یا
          مشکلی برای شما پیش بیاید یک مساله طبیعی است. تفاوتی که سرویس‌دهنده‌ها
          را از یکدیگر متمایز می‌کند، نوع برخورد آن‌ها با مشکل یا سوال شماست.
          علی‌بابا با تیم پشتیبانی 24 ساعته که 247 نفر پشتیبان متخصص و متعهد در
          آن حضور دارند، در تمام ایام هفته و در کل ساعات روز، همیشه آماده
          پاسخگویی به شماست. طبق یکی از آخرین نظرسنجی‌هایی که انجام شده است، بیش
          از 97 درصد از مشتریانی که از خدمات علی‌بابا استفاده کرده‌اند، رضایت
          کامل از آن داشته و آن را به دوستان و آشنایان خودشان پیشنهاد کرده‌اند.
        </p>
      </div>
    </div>
  );
}
export default InfoSection;
